---
kind: type
id: T:Autodesk.Revit.DB.ViewportPositioning
source: html/ef1bc472-5074-ae92-0d7e-37367c03546b.htm
---
# Autodesk.Revit.DB.ViewportPositioning

An enumerated type listing of viewport positioning options on the sheet when swapped to another view.

## Syntax (C#)
```csharp
public enum ViewportPositioning
```